@echo off
:: Check for admin rights
net session >nul 2>&1
if %errorLevel% neq 0 (
    echo you are running the beta 
    timeout /t 1 >nul
    echo for this the script has to self-sign for it to work properly with admin privileges
    timeout /t 1 >nul
    echo attempting to auto self-sign
    timeout /t 2 >nul
    powershell -Command "Start-Process '%~f0' -Verb RunAs"
    exit
)

:: Your admin commands below
mode 100, 25
title Steam Unlocker - by Rueben Software
chcp 65001 >nul


timeout /t 2 >nul
cls
goto banner
:banner
cls
echo.
echo.
echo                         [38;5;21m██████╗ ██╗   ██╗███████╗██████╗ ███████╗███╗   ██╗
echo                         [38;5;27m██╔══██╗██║   ██║██╔════╝██╔══██╗██╔════╝████╗  ██║
echo                         [38;5;33m██████╔╝██║   ██║█████╗  ██████╔╝█████╗  ██╔██╗ ██║
echo                         [38;5;39m██╔══██╗██║   ██║██╔══╝  ██╔══██╗██╔══╝  ██║╚██╗██║
echo                         [38;5;45m██║  ██║╚██████╔╝███████╗██████╔╝███████╗██║ ╚████║
echo                         [38;5;201╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═════╝ ╚══════╝╚═╝  ╚═══╝           
echo                                                     SOFTWARE                                                           
echo.
echo.
echo                  ╔
echo                  ║
echo                  ╠ 1) Unlock Steam
echo                  ║
echo                  ╠ 2) Revert Unlock
echo                  ║
echo                  ╠ 3) Patcher (beta)
echo                  ║
echo                  ║ 4) Exit
echo                  ║
set /p choice=.                ╚   
echo.

if "%choice%"=="1" goto unlock
if "%choice%"=="2" goto rueben
if "%choice%"=="3" goto patcher
if "%choice%"=="4" goto exit
goto error

:unlock
cls
taskkill /f /im steam.exe
cd C:\Program Files
del SteamTools
mkdir SteamTools
cd SteamTools
curl -o steamtools.rar https://cdn.rueben.xyz/content/unlockercli/SteamTools.rar
tar -xf steamtools.rar
start SteamTools.exe
timeout /t 5 >nul
cd C:\Program Files (x86)\Steam
start steam.exe
taskkill /f /im steam.exe
taskkill /f /im SteamTools.exe
goto success

:rueben
cls
echo.
echo.
echo                         [38;5;21m██████╗ ██╗   ██╗███████╗██████╗ ███████╗███╗   ██╗
echo                         [38;5;27m██╔══██╗██║   ██║██╔════╝██╔══██╗██╔════╝████╗  ██║
echo                         [38;5;33m██████╔╝██║   ██║█████╗  ██████╔╝█████╗  ██╔██╗ ██║
echo                         [38;5;39m██╔══██╗██║   ██║██╔══╝  ██╔══██╗██╔══╝  ██║╚██╗██║
echo                         [38;5;45m██║  ██║╚██████╔╝███████╗██████╔╝███████╗██║ ╚████║
echo                         [38;5;201╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═════╝ ╚══════╝╚═╝  ╚═══╝               
echo                                                     SOFTWARE                                                                   
echo.
echo.
echo                  ╔
echo                  ║ ➔ This feature hasn't been implemented yet . . . 
echo                  ║
echo                  ║ ➔ Reinstall Steam to remove Unlock for now . . . 
echo                  ╚ 
echo. 
timeout /t 3 >nul
goto banner

:exit
cls
echo.
echo.
echo                         [38;5;21m██████╗ ██╗   ██╗███████╗██████╗ ███████╗███╗   ██╗
echo                         [38;5;27m██╔══██╗██║   ██║██╔════╝██╔══██╗██╔════╝████╗  ██║
echo                         [38;5;33m██████╔╝██║   ██║█████╗  ██████╔╝█████╗  ██╔██╗ ██║
echo                         [38;5;39m██╔══██╗██║   ██║██╔══╝  ██╔══██╗██╔══╝  ██║╚██╗██║
echo                         [38;5;45m██║  ██║╚██████╔╝███████╗██████╔╝███████╗██║ ╚████║
echo                         [38;5;201╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═════╝ ╚══════╝╚═╝  ╚═══╝      
echo                                                     SOFTWARE                                                                            
echo.
echo.
echo                  ╔
echo                  ║ ➔ Exiting . . . 
echo                  ╚ 
echo. 
timeout /t 1 >nul
exit

:error
cls
echo.
echo.
echo                         [38;5;21m██████╗ ██╗   ██╗███████╗██████╗ ███████╗███╗   ██╗
echo                         [38;5;27m██╔══██╗██║   ██║██╔════╝██╔══██╗██╔════╝████╗  ██║
echo                         [38;5;33m██████╔╝██║   ██║█████╗  ██████╔╝█████╗  ██╔██╗ ██║
echo                         [38;5;39m██╔══██╗██║   ██║██╔══╝  ██╔══██╗██╔══╝  ██║╚██╗██║
echo                         [38;5;45m██║  ██║╚██████╔╝███████╗██████╔╝███████╗██║ ╚████║
echo                         [38;5;201╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═════╝ ╚══════╝╚═╝  ╚═══╝            
echo                                                     SOFTWARE                                                                      
echo.
echo.
echo                  ╔
echo                  ║ ➔ Unknown request, type 1, 2, or 3 . . . 
echo                  ╚ 
echo. 
timeout /t 3 >nul
goto banner

:error2
cls
echo.
echo.
echo                         [38;5;21m██████╗ ██╗   ██╗███████╗██████╗ ███████╗███╗   ██╗
echo                         [38;5;27m██╔══██╗██║   ██║██╔════╝██╔══██╗██╔════╝████╗  ██║
echo                         [38;5;33m██████╔╝██║   ██║█████╗  ██████╔╝█████╗  ██╔██╗ ██║
echo                         [38;5;39m██╔══██╗██║   ██║██╔══╝  ██╔══██╗██╔══╝  ██║╚██╗██║
echo                         [38;5;45m██║  ██║╚██████╔╝███████╗██████╔╝███████╗██║ ╚████║
echo                         [38;5;201╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═════╝ ╚══════╝╚═╝  ╚═══╝            
echo                                                     SOFTWARE                                                                      
echo.
echo.
echo                  ╔
echo                  ║ ➔ Unknown request, type 1, 2, or 3 . . . 
echo                  ╚ 
echo. 
timeout /t 3 >nul
goto patcher

:success
cls
echo.
echo.
echo                         [38;5;21m██████╗ ██╗   ██╗███████╗██████╗ ███████╗███╗   ██╗
echo                         [38;5;27m██╔══██╗██║   ██║██╔════╝██╔══██╗██╔════╝████╗  ██║
echo                         [38;5;33m██████╔╝██║   ██║█████╗  ██████╔╝█████╗  ██╔██╗ ██║
echo                         [38;5;39m██╔══██╗██║   ██║██╔══╝  ██╔══██╗██╔══╝  ██║╚██╗██║
echo                         [38;5;45m██║  ██║╚██████╔╝███████╗██████╔╝███████╗██║ ╚████║
echo                         [38;5;201╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═════╝ ╚══════╝╚═╝  ╚═══╝            
echo                                                     SOFTWARE                                                                      
echo.
echo.
echo                  ╔
echo                  ║ ➔ Steam has successfully been Unlocked!
echo                  ║
echo                  ║ ➔ You should be able to use any mods by Rueben Software for Steam!
echo                  ╚ 
echo. 
cd C:\Program Files (x86)\Steam
start steam.exe
timeout /t 3 >nul
goto banner

:success2
cls
echo.
echo.
echo                         [38;5;21m██████╗ ██╗   ██╗███████╗██████╗ ███████╗███╗   ██╗
echo                         [38;5;27m██╔══██╗██║   ██║██╔════╝██╔══██╗██╔════╝████╗  ██║
echo                         [38;5;33m██████╔╝██║   ██║█████╗  ██████╔╝█████╗  ██╔██╗ ██║
echo                         [38;5;39m██╔══██╗██║   ██║██╔══╝  ██╔══██╗██╔══╝  ██║╚██╗██║
echo                         [38;5;45m██║  ██║╚██████╔╝███████╗██████╔╝███████╗██║ ╚████║
echo                         [38;5;201╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═════╝ ╚══════╝╚═╝  ╚═══╝            
echo                                                     SOFTWARE                                                                      
echo.
echo.
echo                  ╔
echo                  ║ ➔ A Rueben Software mod has been installed: Lethal Company patch!
echo                  ║
echo                  ║ ➔ You should be able to find your game in the Steam library!
echo                  ╚ 
echo. 
cd C:\Program Files (x86)\Steam
start steam.exe
timeout /t 3 >nul
goto banner

:success2
cls
echo.
echo.
echo                         [38;5;21m██████╗ ██╗   ██╗███████╗██████╗ ███████╗███╗   ██╗
echo                         [38;5;27m██╔══██╗██║   ██║██╔════╝██╔══██╗██╔════╝████╗  ██║
echo                         [38;5;33m██████╔╝██║   ██║█████╗  ██████╔╝█████╗  ██╔██╗ ██║
echo                         [38;5;39m██╔══██╗██║   ██║██╔══╝  ██╔══██╗██╔══╝  ██║╚██╗██║
echo                         [38;5;45m██║  ██║╚██████╔╝███████╗██████╔╝███████╗██║ ╚████║
echo                         [38;5;201╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═════╝ ╚══════╝╚═╝  ╚═══╝            
echo                                                     SOFTWARE                                                                      
echo.
echo.
echo                  ╔
echo                  ║ ➔ A Rueben Software mod is installing: Repo patch!
echo                  ║
echo                  ║ ➔ You should be able to find your game in the Steam library after installer finishes!
echo                  ╚ 
echo. 
cd C:\Program Files (x86)\Steam
timeout /t 3 >nul
goto banner

:patcher
cls
echo.
echo.
echo                         [38;5;21m██████╗ ██╗   ██╗███████╗██████╗ ███████╗███╗   ██╗
echo                         [38;5;27m██╔══██╗██║   ██║██╔════╝██╔══██╗██╔════╝████╗  ██║
echo                         [38;5;33m██████╔╝██║   ██║█████╗  ██████╔╝█████╗  ██╔██╗ ██║
echo                         [38;5;39m██╔══██╗██║   ██║██╔══╝  ██╔══██╗██╔══╝  ██║╚██╗██║
echo                         [38;5;45m██║  ██║╚██████╔╝███████╗██████╔╝███████╗██║ ╚████║
echo                         [38;5;201╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═════╝ ╚══════╝╚═╝  ╚═══╝            
echo                                                     SOFTWARE BETA                                                                     
echo                  ╔ PATCHER
echo                  ║
echo                  ╠ 1) Lethal Company
echo                  ║
echo                  ╠ 2) Repo
echo                  ║
echo                  ╠ 3) Back
echo                  ║
set /p noice=.                ╚   
echo.

if "%noice%"=="1" goto patch-lc-beta
if "%noice%"=="2" goto patch-repo
if "%noice%"=="3" goto banner
goto error2

:patch-lc-beta
taskkill /f /im Steam.exe
cd C:\Program Files (x86)\Steam\config
mkdir stplug-in
cd stplug-in
curl -o 1966720.lua https://cdn.rueben.xyz/content/unlockercli/patchercli-beta/1966720-lc.lua
goto success2

:patch-repo
taskkill /f /im Steam.exe
cd C:\Program Files\SteamTools
curl -o repo.bat https://cdn.rueben.xyz/content/unlockercli/patchercli-beta/repo-latest.bat
start repo.bat
goto success3
